app/controllers/notes_controller.rb

  def index
    @user = current_user
    @notes = @user.notes.all(:order => 'created_at DESC')
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1 ORDER BY created_at DESC

  def create
    @user = current_user
    @note = @user.notes.new(params[:note])
	 if @note.title == ""
	    params = parse_html(@note)
	    @note.title = params[0]
	    @note.description = params[1]
	 end
    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("created_at", "description", "link", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 05 Feb 2013 12:02:44 UTC +00:00], ["description", "njdcd"], ["link", "dncdcd"], ["title", "note1"], ["updated_at", Tue, 05 Feb 2013 12:02:44 UTC +00:00], ["user_id", 9]]

  def update
    @note = Note.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT 1  [["id", "2"]]
UPDATE "notes" SET "title" = '', "description" = '', "updated_at" = '2013-02-26 19:15:37.293932' WHERE "notes"."id" = 22

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT 1  [["id", "6"]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 6]]